{"format": "layers-model", "generatedBy": "keras v3.9.2", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.9.2", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "generator", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_layer_18"}, "name": "input_layer_18", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_8", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "input_dim": 5, "output_dim": 100, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}, "name": "embedding_8", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "int32", "keras_history": ["input_layer_18", 0, 0]}}], "kwargs": {}}]}, {"class_name": "InputLayer", "config": {"batch_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_17"}, "name": "input_layer_17", "inbound_nodes": []}, {"class_name": "Flatten", "config": {"name": "flatten_8", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last"}, "name": "flatten_8", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 100], "dtype": "float32", "keras_history": ["embedding_8", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Multiply", "config": {"name": "multiply_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "name": "multiply_4", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 100], "dtype": "float32", "keras_history": ["input_layer_17", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 100], "dtype": "float32", "keras_history": ["flatten_8", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_33", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_33", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 100], "dtype": "float32", "keras_history": ["multiply_4", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "batch_normalization_12", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float32", "keras_history": ["dense_33", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_23", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "negative_slope": 0.2}, "name": "leaky_re_lu_23", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float32", "keras_history": ["batch_normalization_12", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_34", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float32", "keras_history": ["leaky_re_lu_23", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "batch_normalization_13", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 512], "dtype": "float32", "keras_history": ["dense_34", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_24", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "negative_slope": 0.2}, "name": "leaky_re_lu_24", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 512], "dtype": "float32", "keras_history": ["batch_normalization_13", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_35", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_35", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 512], "dtype": "float32", "keras_history": ["leaky_re_lu_24", 0, 0]}}], "kwargs": {}}]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "name": "batch_normalization_14", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1024], "dtype": "float32", "keras_history": ["dense_35", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_25", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "negative_slope": 0.2}, "name": "leaky_re_lu_25", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1024], "dtype": "float32", "keras_history": ["batch_normalization_14", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_36", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 251, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_36", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1024], "dtype": "float32", "keras_history": ["leaky_re_lu_25", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_layer_17", 0, 0], ["input_layer_18", 0, 0]], "output_layers": [["dense_36", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_12/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_12/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_12/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_12/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_13/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_13/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_13/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_13/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_14/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "dense_33/kernel", "shape": [100, 256], "dtype": "float32"}, {"name": "dense_33/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_34/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "dense_34/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_35/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "dense_35/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_36/kernel", "shape": [1024, 251], "dtype": "float32"}, {"name": "dense_36/bias", "shape": [251], "dtype": "float32"}, {"name": "embedding_8/embeddings", "shape": [5, 100], "dtype": "float32"}]}]}